//Задание 1
let x = 10;
let y = 12;
let z = 3;

 console.log(x += y - x++ * z); //ОР 10+(12-10*3) = -8 при x=10 y=12 z=3
// console.log(z = --x - y * 5); //ОР 9-12*5 = -51 при x=10 y=12 z=3
// console.log(y /= x + 5 % z); //ОР 12/(10+5%3) = 12/(10+2) = 1 при x=10 y=12 z=3
// console.log(z = x++ + y * 5); //ОР 10+12*5 = 70 при x=10 y=12 z=3
// console.log(x = y - x++ * z); //ОР 12-10*3 = -18 при x=10 y=12 z=3

//порядок действий выполняется как в математике - сначала /*, затем +-

//Задание 2
let a = 10;
let b = 5;
let c = 89;

console.log('Cреднее арифметическое трех целочисленных значений = ' + Math.round((a+b+c)/3));

//Задание 3
let number = 8;
if (number>5 && number<10) {
    console.log('Число больше 5 и меньше 10');
} else {
    console.log('Неизвестное число');
}

//Задание 4
let TC = 38;
let TF;

TF = (TC*9/5) + 32;
console.log('температура по Фаренгейту = ' + TF);